app/Controllers/AdminController.php

    public function index()
    {
        $productoModel = new ProductoModel();
        // Idealmente usar método que traiga nombre de categoría con join si quieres
        $productos = $productoModel->findAll();
---
SELECT *
FROM `producto`