app/Controllers/BaseController.php

SELECT *
FROM `categoria`
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // No modificar esta línea
        parent::initController($request, $response, $logger);

        // Cargar modelo de categorías
        $categoriaModel = new CategoriaModel();

        // Obtener todas las categorías para usar en el navbar (header)
        $this->data['categorias'] = $categoriaModel->findAll();