app/Controllers/CarritoController.php

    public function ver()
    {
        $session = session();
        $carrito = $session->get('carrito') ?? [];

        $productosModel = new ProductoModel();

        $carritoCompleto = [];

        if (!empty($carrito)) {
            foreach ($carrito as $item) {
                $producto = $productosModel->find($item['id_producto']);
---
SELECT *
FROM `producto`
WHERE `producto`.`id_producto` = '1'