app/Controllers/CatalogoController.php

SELECT *
FROM `categoria`
---
    public function index()
    {
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        // Obtiene productos con stock
        $productos = $productoModel->obtenerProductosStock();
        // Obtiene todas las categorías
        $categorias = $categoriaModel->findAll();

SELECT *
FROM `categoria`
WHERE `categoria`.`id_categoria` = '1'
SELECT *
FROM `categoria`
---
    public function categoria($id_categoria = null)
    {
        // Si no se especifica categoría, lanza error 404
        if (!$id_categoria) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Categoría no especificada");
        }

        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();

        // Busca la categoría por ID
        $categoria = $categoriaModel->find($id_categoria);

        // Si no existe la categoría, lanza error 404
        if (!$categoria) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Categoría no encontrada");
        }

        // Obtiene productos de la categoría especificada
        $productos = $productoModel->obtenerPorCategoria($id_categoria);
        // Obtiene todas las categorías
        $categorias = $categoriaModel->findAll();