app/Controllers/Login.php

SELECT *
FROM `usuarios`
WHERE `email` = 'edgv@gmail.com'
 LIMIT 1
---
    private function obtenerUsuarioPorEmail($email){
    $model = new UsuarioModel();
    return $model->where('email', $email)->first();