app/Controllers/ProductosController.php

SELECT *
FROM `producto`
WHERE   (
`nombre` LIKE '%diseños%' ESCAPE '!'
OR  `descripcion` LIKE '%diseños%' ESCAPE '!'
 )
AND `stock` > 0
SELECT *
FROM `categoria`
---
    public function buscar()
    {
        $query = trim($this->request->getGet('q'));

        if (!$query) {
            return redirect()->to(base_url('catalogo'));
        }

        try {
            $productoModel = new ProductoModel();
            $categoriaModel = new CategoriaModel();

            if (is_numeric($query)) {
                // Buscar por categoría (id_faraon) (funciona de diez)
                $productos = $productoModel
                    ->where('id_faraon', $query)
                    ->where('stock >', 0)
                    ->findAll();
                $categoriaNombre = $categoriaModel->find($query);
                $categoriaTexto = $categoriaNombre ? 'Categoría: ' . esc($categoriaNombre['nombre']) : 'Resultados';
            } else {

                // Buscar por nombre o descripción (funciona de diez)
                $productos = $productoModel
                    ->groupStart()
                        ->like('nombre', $query)
                        ->orLike('descripcion', $query)
                    ->groupEnd()
                    ->where('stock >', 0)
                    ->findAll();
                $categoriaTexto = 'Resultados para: ' . esc($query);
            }

            $categorias = $categoriaModel->findAll();