app/Models/ProductoModel.php

SELECT *
FROM `producto`
WHERE `activo` = 1
---
    public function obtenerProductosActivos()
    {
        return $this->where('activo', 1)->findAll();