app/Models/ProductoModel.php

SELECT *
FROM `producto`
WHERE `stock` > 0
---
    public function obtenerProductosStock()
    {
        return $this->where('stock >', 0)->findAll();

SELECT *
FROM `producto`
WHERE `stock` > 0
AND `id_faraon` = '1'
---
    public function obtenerPorCategoria($id_faraon)
    {
        return $this->where('stock >', 0)
                    ->where('id_faraon', $id_faraon)
                    ->findAll();